ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S16-EVK/LPC55S16_LoRaFUOTA/source/W25Q128.c
/*
 * W25Q128.c
 *
 *  Created on: 05.01.2019
 *      Author: Erich Styger
 */

#include "W25Q128.h"
#include "utilities.h"
#include "McuUtility.h"
#include "McuGPIO.h"
#include "McuWait.h"
#include "LPC55S16.h"
#include "fsl_spi.h"
#include "McuShell.h"
#include "spi.h"
#include "spi-board.h"
#include "McuLog.h"

#define W25_CMD_PAGE_PROGRAM  0x02
#define W25_CMD_DATA_READ     0x03

#define W25_CMD_READ_STATUS1  0x05

#define W25_CMD_WRITE_ENABLE  0x06
#define W25_CMD_WRITE_DISABLE  0x04

#define W25_CMD_GET_ID        0x9F
#define W25_ID0_WINBOND       0xEF

#define W25_CMD_GET_SERIAL    0x4B

#define W25_CMD_SECTOR_ERASE_4K 0x20
#define W25_CMD_BLOCK_ERASE_32K 0x52
#define W25_CMD_BLOCK_ERASE_64K 0xD8
#define W25_CMD_CHIP_ERASE      0xC7

static Spi_t         Spi_FC3;
McuGPIO_Handle_t SPI_NSS;

/* W25Q128 chip select is LOW active */
#define W25_CS_ENABLE()   McuGPIO_SetLow(SPI_NSS)
#define W25_CS_DISABLE()  McuGPIO_SetHigh(SPI_NSS)
#define TRANSFER_SIZE 							1
static uint8_t rxDummy; /* dummy byte if we do not need the result. Needed to read from SPI register. */



#define TRANSFER_SIZE 4U /*! Transfer dataSize */


/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void SPI_MasterUserCallback(SPI_Type *base, spi_dma_handle_t *handle, status_t status, void *userData);
static void W25Q_MasterInit(void);
static void W25Q_MasterDMASetup(void);
static void W25Q_MasterStartDMATransfer(void);
static void W25Q_TransferDataCheck(uint8_t *buf, uint8_t *masterRxData_temp, size_t buffSize);
static void SPI_WRITE_READ_CMD(uint8_t cmd, uint8_t *buf, size_t bufSize);
static void SPI_READ_W25(uint8_t command ,uint32_t address, uint8_t *buf, size_t bufSize);
static void SPI_WRITE_W25(uint8_t command ,uint32_t address, const uint8_t *buf, size_t bufSize);
/*******************************************************************************
 * Variables
 ******************************************************************************/
uint8_t masterRxData[TRANSFER_SIZE] = {0};
uint8_t masterTxData[TRANSFER_SIZE] = {0};

dma_handle_t masterTxHandle;
dma_handle_t masterRxHandle;

spi_dma_handle_t masterHandle;

volatile bool isTransferCompleted = false;


typedef struct {
	SpiId_t id;
	SPI_Type *type;
	uint32_t srcClk;
	spi_master_config_t masterConfig;
	spi_transfer_t xfr;
	uint8_t masterRxData[TRANSFER_SIZE];
	uint8_t masterTxData[TRANSFER_SIZE];
} lpcSpiHandle_t;

#if(LPC_NUMBER_OF_SPI > 0)
static lpcSpiHandle_t spiHandle0 = {
	.id = SPI_1,
	.type = LPC_SPI3_TYPE,
};
#endif
#if(LPC_NUMBER_OF_SPI > 1)
static lpcSpiHandle_t spiHandle1 = {
	.id = SPI_2,
	.type = LPC_SPI2_TYPE,
};
#endif


/*******************************************************************************
 * Code
 ******************************************************************************/
static void SPI_MasterUserCallback(SPI_Type *base, spi_dma_handle_t *handle, status_t status, void *userData)
{
    if (status == kStatus_Success)
    {
        isTransferCompleted = true;
    }
}

#define SPI_WRITE(write){}
//   {
//    // while(SM1_SendChar(write)!=ERR_OK) {} \
//    // while(SM1_RecvChar(&rxDummy)!=ERR_OK) {}
//   }
#define SPI_WRITE_READ(write, readP) {}
//   {
//   // while(SM1_SendChar(write)!=ERR_OK) {} \
//   //  while(SM1_RecvChar(readP)!=ERR_OK) {}
//   }



static void W25_MapSpiIdToHandle(SpiId_t spiId, lpcSpiHandle_t **handle);


uint16_t W25_SpiInOut(Spi_t *obj, uint16_t outData) {

	lpcSpiHandle_t *handle;
	W25_MapSpiIdToHandle(obj->SpiId, &handle);

	handle->masterRxData[0] = 0x00;
	handle->masterTxData[0] = (uint8_t) (outData);
	 W25_CS_ENABLE();
	CRITICAL_SECTION_BEGIN();

	/* Start master transfer, send data to slave */
	handle->xfr.txData = handle->masterTxData;
	handle->xfr.rxData = handle->masterRxData;
	handle->xfr.dataSize = TRANSFER_SIZE;
	handle->xfr.configFlags = kSPI_FrameAssert;
	if (kStatus_Success != SPI_MasterTransferBlocking(handle->type, &(handle->xfr))) {
		CRITICAL_SECTION_END();
		/* Error occured */
	}

	CRITICAL_SECTION_END();
	W25_CS_DISABLE();
	return handle->masterRxData[0];
}



bool W25_isBusy(void) {
  uint8_t status;

  W25_ReadStatus1(&status);
  return (status&1);
}

void W25_WaitIfBusy(void) {
  while(W25_isBusy()) {
	  McuWait_Waitus(10);
  }
}

uint8_t W25_Read(uint32_t address, uint8_t *buf, size_t bufSize) {
  size_t i;
  W25_WaitIfBusy();
  SPI_READ_W25(W25_CMD_DATA_READ, address, buf, bufSize);
  return ERR_OK;
}

uint8_t W25_EraseAll(void) {
  W25_WaitIfBusy();
  SPI_WRITE_READ_CMD(W25_CMD_WRITE_ENABLE, NULL, 0);
  SPI_WRITE_READ_CMD(W25_CMD_CHIP_ERASE, NULL, 0);
  SPI_WRITE_READ_CMD(W25_CMD_WRITE_DISABLE, NULL, 0);
  return ERR_OK;
}


uint8_t W25_EraseSector4K(uint32_t address) {
  W25_WaitIfBusy();
  SPI_WRITE_READ_CMD(W25_CMD_WRITE_ENABLE, NULL, 0);
  SPI_WRITE_W25(W25_CMD_SECTOR_ERASE_4K, address, NULL, 0);
  SPI_WRITE_READ_CMD(W25_CMD_WRITE_DISABLE, NULL, 0);
  return ERR_OK;
}

uint8_t W25_EraseBlock32K(uint32_t address) {
  W25_WaitIfBusy();
  SPI_WRITE_READ_CMD(W25_CMD_WRITE_ENABLE, NULL, 0);
  SPI_WRITE_W25(W25_CMD_BLOCK_ERASE_32K, address, NULL, 0);
  SPI_WRITE_READ_CMD(W25_CMD_WRITE_DISABLE, NULL, 0);
  return ERR_OK;
}

uint8_t W25_EraseBlock64K(uint32_t address) {
  W25_WaitIfBusy();
  SPI_WRITE_READ_CMD(W25_CMD_WRITE_ENABLE, NULL, 0);
  SPI_WRITE_W25(W25_CMD_BLOCK_ERASE_64K, address, NULL, 0);
  SPI_WRITE_READ_CMD(W25_CMD_WRITE_DISABLE, NULL, 0);
  return ERR_OK;
}

/*!
 * Program a page with data
 * \param address, should be aligned on page (256 bytes) if programming 256 bytes
 * \param data pointer to data
 * \param dataSize size of data in bytes, max 256
 * \return error code, ERR_OK for no error
 */
uint8_t W25_ProgramPage(uint32_t address, const uint8_t *data, size_t dataSize) {
  W25_WaitIfBusy();
  SPI_WRITE_READ_CMD(W25_CMD_WRITE_ENABLE, NULL, 0);
  SPI_WRITE_W25(W25_CMD_PAGE_PROGRAM, address, data, dataSize);
  SPI_WRITE_READ_CMD(W25_CMD_WRITE_DISABLE, NULL, 0);

  return ERR_OK;
}


uint8_t W25_GetCapacity(const uint8_t *id, uint32_t *capacity) {
  uint32_t n = 0x100000; // unknown chips, default to 1 MByte

  if (id[2] >= 16 && id[2] <= 31) {
    n = 1ul << id[2];
  } else if (id[2] >= 32 && id[2] <= 37) {
    n = 1ul << (id[2] - 6);
  } else if ((id[0]==0 && id[1]==0 && id[2]==0) || (id[0]==255 && id[1]==255 && id[2]==255)) {
    *capacity = 0;
    return ERR_FAILED;
  }
  *capacity = n;
  return ERR_OK;
}

uint8_t W25_ReadStatus1(uint8_t *status) {
	/* W25Q128 should report Serialnumber */
	SPI_WRITE_READ_CMD(W25_CMD_READ_STATUS1, status, sizeof(status));

  return ERR_OK;
}

uint8_t W25_ReadSerialNumber(uint8_t *buf, size_t bufSize) {
  int i;

  if (bufSize<W25_SERIAL_BUF_SIZE) {
    return ERR_OVERFLOW; /* buffer not large enough */
  }

  /* W25Q128 should report Serialnumber */
  SPI_WRITE_READ_CMD(W25_CMD_GET_SERIAL, buf, bufSize);

  return ERR_OK;

