ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S16-EVK/LPC55S16_LoRaFUOTA/source/W25Q128.c
static void W25Q_MasterInit(void)
{
    /* SPI init */
    uint32_t srcClock_Hz = 0U;
    spi_master_config_t masterConfig;
    srcClock_Hz = W25Q_SPI_MASTER_CLK_FREQ;

    SPI_MasterGetDefaultConfig(&masterConfig);
    masterConfig.sselNum = (spi_ssel_t)W25Q_SPI_SSEL;
    masterConfig.sselPol = (spi_spol_t)W25Q_MASTER_SPI_SPOL;
    SPI_MasterInit(W25Q_SPI_MASTER, &masterConfig, srcClock_Hz);
}

static void W25Q_MasterDMASetup(void)
{
    /* DMA init */
    DMA_Init(W25Q_DMA);
    /* Configure the DMA channel,priority and handle. */
    DMA_EnableChannel(W25Q_DMA, W25Q_SPI_MASTER_TX_CHANNEL);
    DMA_EnableChannel(W25Q_DMA, W25Q_SPI_MASTER_RX_CHANNEL);
    DMA_SetChannelPriority(W25Q_DMA, W25Q_SPI_MASTER_TX_CHANNEL, kDMA_ChannelPriority1);
    DMA_SetChannelPriority(W25Q_DMA, W25Q_SPI_MASTER_RX_CHANNEL, kDMA_ChannelPriority0);
    DMA_CreateHandle(&masterTxHandle, W25Q_DMA, W25Q_SPI_MASTER_TX_CHANNEL);
    DMA_CreateHandle(&masterRxHandle, W25Q_DMA, W25Q_SPI_MASTER_RX_CHANNEL);
}


static void SPI_WRITE_READ_CMD(uint8_t command, uint8_t *buf, size_t buffSize){
	spi_transfer_t masterXfer;
	uint32_t i = 0U;
	uint8_t *masterRxData_temp = malloc(buffSize+2 * sizeof(uint8_t));
	uint8_t *masterTxData_temp = malloc(buffSize+2 * sizeof(uint8_t));
	masterTxData_temp[0]= command;
	/* Set up handle for spi master */
    SPI_MasterTransferCreateHandleDMA(W25Q_SPI_MASTER, &masterHandle, SPI_MasterUserCallback, NULL, &masterTxHandle,
                                      &masterRxHandle);

	/* Start master transfer */
	//0x9F
	masterXfer.txData      = (uint8_t *)masterTxData_temp;
	masterXfer.rxData      = (uint8_t *)masterRxData_temp;
	masterXfer.dataSize    = (buffSize+2) * sizeof(masterTxData_temp[0]);
	masterXfer.configFlags = kSPI_FrameAssert;

	if (kStatus_Success != SPI_MasterTransferDMA(W25Q_SPI_MASTER, &masterHandle, &masterXfer))
	{
		//PRINTF("There is an error when start SPI_MasterTransferDMA \r\n ");
	}

	W25Q_TransferDataCheck(buf, masterRxData_temp, buffSize);
//	McuWait_Waitus(1);
//	memcpy(buf, masterRxData_temp+1, buffSize * sizeof(masterRxData_temp[0]));
//	free(masterRxData_temp);free(masterTxData_temp);
}


static void SPI_READ_W25(uint8_t command ,uint32_t address, uint8_t *buf, size_t buffSize){
	spi_transfer_t masterXfer;
	uint32_t i = 0U;
	uint8_t *masterRxData_temp = malloc(buffSize+4 * sizeof(uint8_t));
	uint8_t *masterTxData_temp = malloc(buffSize+4 * sizeof(uint8_t));
	masterTxData_temp[0]= command;
	masterTxData_temp[1]= address>>16;
	masterTxData_temp[2]= address>>8;
	masterTxData_temp[3]= address;
	/* Set up handle for spi master */
    SPI_MasterTransferCreateHandleDMA(W25Q_SPI_MASTER, &masterHandle, SPI_MasterUserCallback, NULL, &masterTxHandle,
                                      &masterRxHandle);

	/* Start master transfer */
	//0x9F
	masterXfer.txData      = (uint8_t *)masterTxData_temp;
	masterXfer.rxData      = (uint8_t *)masterRxData_temp;
	masterXfer.dataSize    = (buffSize+4) * sizeof(masterTxData_temp[0]);
	masterXfer.configFlags = kSPI_FrameAssert;

	if (kStatus_Success != SPI_MasterTransferDMA(W25Q_SPI_MASTER, &masterHandle, &masterXfer))
	{
		//PRINTF("There is an error when start SPI_MasterTransferDMA \r\n ");
	}
	W25Q_TransferDataCheck(buf, masterRxData_temp, buffSize);
}

static void SPI_WRITE_W25(uint8_t command, uint32_t address, const uint8_t *buf, size_t buffSize){

	spi_transfer_t masterXfer;
	uint32_t i = 0U;
	uint8_t *masterRxData_temp = malloc(buffSize+4 * sizeof(uint8_t));
	uint8_t *masterTxData_temp = malloc(buffSize+4 * sizeof(uint8_t));
	masterTxData_temp[0]= command;
	masterTxData_temp[1]= address>>16;
	masterTxData_temp[2]= address>>8;
	masterTxData_temp[3]= address;

	for (int i = 0; i < buffSize; ++i)
	{
		masterTxData_temp[4+i]= buf[i];
	}

	/* Set up handle for spi master */
    SPI_MasterTransferCreateHandleDMA(W25Q_SPI_MASTER, &masterHandle, SPI_MasterUserCallback, NULL, &masterTxHandle,
                                      &masterRxHandle);

	/* Start master transfer */
	//0x9F
	masterXfer.txData      = (uint8_t *)masterTxData_temp;
	masterXfer.rxData      = (uint8_t *)masterRxData_temp;
	masterXfer.dataSize    = (buffSize+4) * sizeof(masterTxData_temp[0]);
	masterXfer.configFlags = kSPI_FrameAssert;

	if (kStatus_Success != SPI_MasterTransferDMA(W25Q_SPI_MASTER, &masterHandle, &masterXfer))
	{
		//PRINTF("There is an error when start SPI_MasterTransferDMA \r\n ");
	}
	W25Q_TransferDataCheck(NULL,NULL,NULL);
}


static void W25Q_TransferDataCheck(uint8_t *buf, uint8_t *masterRxData_temp, size_t buffSize)
{

    /* Wait until transfer completed */
    while (!isTransferCompleted)
    {
    }
	McuWait_Waitms(1);
	memcpy(buf, masterRxData_temp+1, buffSize * sizeof(masterRxData_temp[0]));

}


//static void W25Q_MasterStartDMATransfer(void)
//{
//    spi_transfer_t masterXfer;
//    uint32_t i = 0U;
//
//    /* Set up the transfer data */
//    for (i = 0U; i < TRANSFER_SIZE; i++)
//    {
//        /* SPI is configured for 8 bits transfer - set only lower 8 bits of buffers */
//        masterTxData[i] = 0U;
//        masterRxData[i] = 0U;
//    }
//    masterTxData[0] = W25_CMD_GET_ID;
//    /* Set up handle for spi master */
//    SPI_MasterTransferCreateHandleDMA(W25Q_SPI_MASTER, &masterHandle, SPI_MasterUserCallback, NULL, &masterTxHandle,
//                                      &masterRxHandle);
//
//    /* Start master transfer */
//    masterXfer.txData      = (uint8_t *)&masterTxData;
//    masterXfer.rxData      = (uint8_t *)&masterRxData;
//    masterXfer.dataSize    = TRANSFER_SIZE * sizeof(masterTxData[0]);
//    masterXfer.configFlags = kSPI_FrameAssert;
//
//    if (kStatus_Success != SPI_MasterTransferDMA(W25Q_SPI_MASTER, &masterHandle, &masterXfer))
//    {
//       // PRINTF("There is an error when start SPI_MasterTransferDMA \r\n ");
//    }
//}

/* from https://github.com/PaulStoffregen/SerialFlash/blob/master/SerialFlashChip.cpp */
//                   size  sector          busy  pgm/erase chip
// Part              Mbyte kbyte ID bytes  cmd   suspend   erase
// ----               ----  ----- --------  --- -------   -----
// Winbond W25Q64CV 8 64  EF     40 17
// Winbond W25Q128FV  16  64     EF 40 18  05  single    60 & C7
// Winbond W25Q256FV  32  64     EF 40 19
// Spansion S25FL064A 8 ? 01     02 16
// Spansion S25FL127S 16  64     01 20 18  05
// Spansion S25FL128P 16  64     01 20 18
// Spansion S25FL256S 32  64     01 02 19  05      60 & C7
// Spansion S25FL512S 64  256    01 02 20
// Macronix MX25L12805D 16  ? C2 20 18
// Macronix MX66L51235F 64    C2 20 1A
// Numonyx M25P128  16  ? 20 20 18
// Micron M25P80  1 ? 20 20 14
// Micron N25Q128A  16  64  20 BA 18
// Micron N25Q512A  64  ? 20 BA 20  70  single    C4 x2
// Micron N25Q00AA  128 64  20 BA 21    single    C4 x4
// Micron MT25QL02GC  256 64  20 BA 22  70      C4 x2
// SST SST25WF010 1/8 ? BF 25 02
// SST SST25WF020 1/4 ? BF 25 03
// SST SST25WF040 1/2 ? BF 25 04
// SST SST25VF016B  1 ? BF 25 41
// SST26VF016     ? BF 26 01
// SST26VF032     ? BF 26 02
// SST25VF032   4 64  BF 25 4A
// SST26VF064   8 ? BF 26 43
// LE25U40CMC   1/2 64  62 06 13
